{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32", "cropping": [[60, 20], [0, 0]]}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "strides": [5, 5], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [5, 5]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa,D:/Stas/learn/Udacity/SDCND/P3/mine/model.py\u00da\b<lambda>\u0097\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_constraint": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "trainable": true, "nb_row": 1, "nb_col": 1, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "nb_filter": 3, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_constraint": null, "activation": "linear", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "nb_row": 3, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "nb_filter": 4, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_constraint": null, "activation": "linear", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "nb_row": 3, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "nb_filter": 4, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "input_dim": null, "output_dim": 1, "activation": "linear", "trainable": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null}}]}